RT-Thread/rt-thread/bsp/nxp/imx/imxrt/imxrt1180-nxp-evk/cm7/board/board.c
    ELE_BaseAPI_VoltageChangeFinish(MU_RT_S3MUA);
}

#if defined(SDK_NETC_USED) && SDK_NETC_USED
void BOARD_NETC_Init(void)
{
    /* EP and Switch port 0 use RMII interface. */
    NETC_SocSetMiiMode(kNETC_SocLinkEp0, kNETC_RmiiMode);
    NETC_SocSetMiiMode(kNETC_SocLinkSwitchPort0, kNETC_RmiiMode);

    /* Switch port 1~3 use RGMII interface. */
    NETC_SocSetMiiMode(kNETC_SocLinkSwitchPort1, kNETC_RgmiiMode);
    NETC_SocSetMiiMode(kNETC_SocLinkSwitchPort2, kNETC_RgmiiMode);
    NETC_SocSetMiiMode(kNETC_SocLinkSwitchPort3, kNETC_RgmiiMode);

    /* Output reference clock for RMII interface. */
    NETC_SocSetRmiiRefClk(kNETC_SocLinkEp0, true);
    NETC_SocSetRmiiRefClk(kNETC_SocLinkSwitchPort0, true);

    /* Unlock the IERB. It will warm reset whole NETC. */
    if (NETC_IERBUnlock() == kStatus_Success)
    {
        while (!NETC_IERBIsUnlockOver())
        {
        }
    }

    /* Set the access attribute, otherwise MSIX access will be blocked. */
    NETC_IERB->ARRAY_NUM_RC[0].RCMSIAMQR &= ~(7U << 27);
    NETC_IERB->ARRAY_NUM_RC[0].RCMSIAMQR |= (1U << 27);

    /* Set PHY address in IERB to use MAC port MDIO, otherwise the access will be blocked. */
    NETC_SocSetLinkAddr(kNETC_SocLinkEp0, BOARD_EP0_PHY_ADDR);
    NETC_SocSetLinkAddr(kNETC_SocLinkSwitchPort0, BOARD_SWT_PORT0_PHY_ADDR);
    NETC_SocSetLinkAddr(kNETC_SocLinkSwitchPort1, BOARD_SWT_PORT1_PHY_ADDR);
    NETC_SocSetLinkAddr(kNETC_SocLinkSwitchPort2, BOARD_SWT_PORT2_PHY_ADDR);
    NETC_SocSetLinkAddr(kNETC_SocLinkSwitchPort3, BOARD_SWT_PORT3_PHY_ADDR);

    /* Lock the IERB. */
    assert(NETC_IERBLock() == kStatus_Success);
    while (!NETC_IERBIsLockOver())
    {
    }
}
#endif /* SDK_NETC_USED */

void BOARD_RequestTRDC(bool bRequestAON, bool bRequestWakeup, bool bReqeustMega)
{
#define ELE_TRDC_AON_ID    0x74
#define ELE_TRDC_WAKEUP_ID 0x78
#define ELE_TRDC_MEGA_ID   0x82
#define ELE_CORE_CM33_ID   0x1
#define ELE_CORE_CM7_ID    0x2

#if (__CORTEX_M == 33)
    uint8_t ele_core_id = ELE_CORE_CM33_ID;
#elif (__CORTEX_M == 7)
    uint8_t ele_core_id = ELE_CORE_CM7_ID;
#endif

    uint32_t ele_fw_sts;

    /* Get ELE FW status */
    ELE_BaseAPI_GetFwStatus(MU_RT_S3MUA, &ele_fw_sts);

    if (bRequestAON)
    {
        /* Release TRDC AON to current core */
        ELE_BaseAPI_ReleaseRDC(MU_RT_S3MUA, ELE_TRDC_AON_ID, ele_core_id);
    }

    /*
     * TRDC MEGA request must be prior to TRDC WAKEUP, as TRDC MEGA access
     * is controlled by the TRDC WAKEUP.
     * note:
     *   If TRDC WAKEUP has been release to one core firstly, then it will fail
     *   to release TRDC MEGA to same/another core.
     */
    if (bReqeustMega)
    {
        /* Release TRDC MEGA to current core */
        ELE_BaseAPI_ReleaseRDC(MU_RT_S3MUA, ELE_TRDC_MEGA_ID, ele_core_id);
    }

    if (bRequestWakeup)
    {
        /* Release TRDC WAKEUP to current core */
        ELE_BaseAPI_ReleaseRDC(MU_RT_S3MUA, ELE_TRDC_WAKEUP_ID, ele_core_id);
    }
}

void APP_CommonTrdcDACSetting(void)
{
    trdc_processor_domain_assignment_t procAssign = { .domainId = 0U,
                                                      .domainIdSelect = kTRDC_DidInput,
                                                      .pidDomainHitConfig = kTRDC_pidDomainHitNone0,
                                                      .pidMask = 0U,
                                                      .secureAttr = kTRDC_ForceSecure,
                                                      .pid = 0U,
                                                      .lock = false };

    trdc_non_processor_domain_assignment_t nonProcAssign = { .domainId = 0U,
                                                             .privilegeAttr = kTRDC_ForcePrivilege,
                                                             .secureAttr = kTRDC_ForceSecure,
                                                             .bypassDomainId = true,
                                                             .lock = false };

    /* 1. Set the MDAC Configuration in TRDC1. */
    /* Configure the access control for CM33(master 1 for TRDC1, MDAC_A1). */
    procAssign.domainId = 0x2U;
    TRDC_SetProcessorDomainAssignment(TRDC1, (uint8_t)kTRDC1_MasterCM33, 0U, &procAssign);
    /* Configure the access control for eDMA3(master 2 for TRDC1, MDAC_A2). */
    nonProcAssign.domainId = 0x7U;
    TRDC_SetNonProcessorDomainAssignment(TRDC1, (uint8_t)kTRDC1_MasterDMA3, &nonProcAssign);

    /* 2. Set the MDAC Configuration in TRDC2. */
    /* Configure the access control for CM7 AHBP(master 0 for TRDC2, MDAC_W0). */
    procAssign.domainId = 0x4U;
    TRDC_SetProcessorDomainAssignment(TRDC2, (uint8_t)kTRDC2_MasterCM7AHBP, 0U, &procAssign);
    /* Configure the access control for CM7 AXI(master 1 for TRDC2, MDAC_W1). */
    TRDC_SetProcessorDomainAssignment(TRDC2, (uint8_t)kTRDC2_MasterCM7AXI, 0U, &procAssign);
    /* Configure the access control for DAP AHB_AP_SYS(master 2 for TRDC2, MDAC_W2). */
    nonProcAssign.domainId = 0x9U;
    TRDC_SetNonProcessorDomainAssignment(TRDC2, (uint8_t)kTRDC2_MasterDAP, &nonProcAssign);
    /* Configure the access control for CoreSight(master 3 for TRDC2, MDAC_W3). */
    nonProcAssign.domainId = 0x8U;
    TRDC_SetNonProcessorDomainAssignment(TRDC2, (uint8_t)kTRDC2_MasterCoreSight, &nonProcAssign);
    /* Configure the access control for DMA4(master 4 for TRDC2, MDAC_W4). */
    nonProcAssign.domainId = 0x7U;
    TRDC_SetNonProcessorDomainAssignment(TRDC2, (uint8_t)kTRDC2_MasterDMA4, &nonProcAssign);
    /* Configure the access control for NETC(master 5 for TRDC2, MDAC_W5). */
    procAssign.domainId = 0xAU;
    TRDC_SetProcessorDomainAssignment(TRDC2, (uint8_t)kTRDC2_MasterNETC, 0U, &procAssign);

    /* 3. Set the MDAC Configuration in TRDC3. */
    /* Configure the access control for uSDHC1(master 0 for TRDC3, MDAC_M0). */
    nonProcAssign.domainId = 0x5U;
    TRDC_SetNonProcessorDomainAssignment(TRDC3, (uint8_t)kTRDC3_MasterUSDHC1, &nonProcAssign);
    /* Configure the access control for uSDHC2(master 1 for TRDC3, MDAC_M1). */
    nonProcAssign.domainId = 0x6U;
    TRDC_SetNonProcessorDomainAssignment(TRDC3, (uint8_t)kTRDC3_MasterUSDHC2, &nonProcAssign);
    /* Configure the access control for USB(master 3 for TRDC3, MDAC_M3). */
    nonProcAssign.domainId = 0xBU;
    TRDC_SetNonProcessorDomainAssignment(TRDC3, (uint8_t)kTRDC3_MasterUsb, &nonProcAssign);
    /* Configure the access control for FlexSPI_FLR(master 4 for TRDC3, MDAC_M4). */
    nonProcAssign.domainId = 0xAU;
    TRDC_SetNonProcessorDomainAssignment(TRDC3, (uint8_t)kTRDC3_MasterFlexspiFlr, &nonProcAssign);
}

