RT-Thread/rt-thread/bsp/nxp/imx/imxrt/imxrt1180-nxp-evk/cm7/board/board.c
void APP_CommonTrdcAccessControlSetting(TRDC_Type *trdc)
{
    trdc_hardware_config_t hwConfig;
    trdc_memory_access_control_config_t memAccessConfig;
    trdc_mbc_memory_block_config_t mbcBlockConfig;
    trdc_mrc_region_descriptor_config_t mrcRegionConfig;

    TRDC_GetHardwareConfig(trdc, &hwConfig);

    /* Enable all read/write/execute access for MRC/MBC access control. */
    (void)memset(&memAccessConfig, 0, sizeof(memAccessConfig));
    memAccessConfig.nonsecureUsrX = 1U;
    memAccessConfig.nonsecureUsrW = 1U;
    memAccessConfig.nonsecureUsrR = 1U;
    memAccessConfig.nonsecurePrivX = 1U;
    memAccessConfig.nonsecurePrivW = 1U;
    memAccessConfig.nonsecurePrivR = 1U;
    memAccessConfig.secureUsrX = 1U;
    memAccessConfig.secureUsrW = 1U;
    memAccessConfig.secureUsrR = 1U;
    memAccessConfig.securePrivX = 1U;
    memAccessConfig.securePrivW = 1U;
    memAccessConfig.securePrivR = 1U;

    for (uint32_t mrc = 0U; mrc < hwConfig.mrcNumber; mrc++)
    {
        if (TRDC_IsValidMrc(trdc, mrc))
        {
            for (uint32_t i = 0U; i < 8U; i++)
            {
                TRDC_MrcSetMemoryAccessConfig(trdc, &memAccessConfig, mrc, i);
            }
        }
    }

    for (uint32_t mbc = 0U; mbc < hwConfig.mbcNumber; mbc++)
    {
        if (TRDC_IsValidMbc(trdc, mbc))
        {
            for (uint32_t i = 0U; i < 8U; i++)
            {
                TRDC_MbcSetMemoryAccessConfig(trdc, &memAccessConfig, mbc, i);
            }
        }
    }

    memset(&mbcBlockConfig, 0, sizeof(mbcBlockConfig));
    mbcBlockConfig.nseEnable = false;
    mbcBlockConfig.memoryAccessControlSelect = 0;

    memset(&mrcRegionConfig, 0, sizeof(mrcRegionConfig));
    mrcRegionConfig.memoryAccessControlSelect = 0U;
    mrcRegionConfig.valid = true;
    mrcRegionConfig.nseEnable = false;
    mrcRegionConfig.regionIdx = 0U;

    for (uint32_t domain = 0; domain < hwConfig.domainNumber; domain++)
    {
        if (TRDC_IsValidDomain(trdc, domain))
        {
            /* Set the configuration for MBC. */
            for (uint32_t mbc = 0U; mbc < hwConfig.mbcNumber; mbc++)
            {
                if (TRDC_IsValidMbc(trdc, mbc))
                {
                    uint32_t mem_num = TRDC_GetMbcMemNum(trdc, mbc);
                    for (uint32_t mem = 0; mem < mem_num; mem++)
                    {
                        if (TRDC_IsValidMbcMem(trdc, mbc, mem))
                        {
                            trdc_slave_memory_hardware_config_t mbcHwConfig;
                            TRDC_GetMbcHardwareConfig(trdc, &mbcHwConfig, mbc, mem);
                            for (uint32_t block = 0; block < mbcHwConfig.blockNum; block++)
                            {
                                mbcBlockConfig.domainIdx = domain;
                                mbcBlockConfig.mbcIdx = mbc;
                                mbcBlockConfig.slaveMemoryIdx = mem;
                                mbcBlockConfig.memoryBlockIdx = block;
                                TRDC_MbcSetMemoryBlockConfig(trdc, &mbcBlockConfig);
                            }
                        }
                    }
                }
            }

            /* Set the configuration for MRC. */
            for (uint32_t mrc = 0U; mrc < hwConfig.mrcNumber; mrc++)
            {
                if (TRDC_IsValidMrc(trdc, mrc))
                {
                    uint32_t start_addr, end_addr;

                    if (TRDC_GetMrcRegionAddr(trdc, mrc, &start_addr, &end_addr))
                    {
                        mrcRegionConfig.startAddr = start_addr;
                        mrcRegionConfig.endAddr = end_addr;
                        mrcRegionConfig.domainIdx = domain;
                        mrcRegionConfig.mrcIdx = mrc;
                        TRDC_MrcSetRegionDescriptorConfig(trdc, &mrcRegionConfig);
                    }
                    else
                    {
                        assert(false);
                    }
                }
            }
        }
    }
}

void BOARD_GrantTRDCFullPermissions(void)
{
    /* 1. Request TRDC ownership */
    BOARD_RequestTRDC(true, true, true);

    /* 2. Config DAC. */
    APP_CommonTrdcDACSetting();

    /* 3. Enable all access control */
    APP_CommonTrdcAccessControlSetting(TRDC1);
    APP_CommonTrdcAccessControlSetting(TRDC2);
}

void BOARD_CommonSetting(void)
{
    BOARD_GrantTRDCFullPermissions();
}

void SysTick_Handler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    rt_tick_increase();

    /* leave interrupt */
    rt_interrupt_leave();
}

#ifdef BSP_USE_MULTICORE
/*!
 * @brief Application-specific implementation of the SystemInitHook() weak function.
 */
void SystemInitHook(void)
{
    /* Initialize MCMGR - low level multicore management library. Call this
       function as close to the reset entry as possible to allow CoreUp event
       triggering. The SystemInitHook() weak function overloading is used in this
       application. */
    (void)MCMGR_EarlyInit();
}
#endif

#ifdef BSP_USING_ETH
void PHY_Reset(void)
{
    /* Reset PHY8201 for ETH4. Reset 10ms, wait 72ms. */
    RGPIO_PinWrite(BOARD_INITPHYACCESSPINS_ENET4_RST_B_GPIO, BOARD_INITPHYACCESSPINS_ENET4_RST_B_GPIO_PIN, 0);
    RGPIO_PinWrite(BOARD_INITPHYACCESSPINS_ENET3_RST_B_GPIO, BOARD_INITPHYACCESSPINS_ENET3_RST_B_GPIO_PIN, 0);
    RGPIO_PinWrite(BOARD_INITPHYACCESSPINS_ENET2_RST_B_GPIO, BOARD_INITPHYACCESSPINS_ENET2_RST_B_GPIO_PIN, 0);
    RGPIO_PinWrite(BOARD_INITPHYACCESSPINS_ENET1_RST_B_GPIO, BOARD_INITPHYACCESSPINS_ENET1_RST_B_GPIO_PIN, 0);
    RGPIO_PinWrite(BOARD_INITPHYACCESSPINS_ENET0_RST_B_GPIO, BOARD_INITPHYACCESSPINS_ENET0_RST_B_GPIO_PIN, 0);
    SDK_DelayAtLeastUs(10000, CLOCK_GetFreq(kCLOCK_CpuClk));
    RGPIO_PinWrite(BOARD_INITPHYACCESSPINS_ENET4_RST_B_GPIO, BOARD_INITPHYACCESSPINS_ENET4_RST_B_GPIO_PIN, 1);
    RGPIO_PinWrite(BOARD_INITPHYACCESSPINS_ENET3_RST_B_GPIO, BOARD_INITPHYACCESSPINS_ENET3_RST_B_GPIO_PIN, 1);
    RGPIO_PinWrite(BOARD_INITPHYACCESSPINS_ENET2_RST_B_GPIO, BOARD_INITPHYACCESSPINS_ENET2_RST_B_GPIO_PIN, 1);
    RGPIO_PinWrite(BOARD_INITPHYACCESSPINS_ENET1_RST_B_GPIO, BOARD_INITPHYACCESSPINS_ENET1_RST_B_GPIO_PIN, 1);
    RGPIO_PinWrite(BOARD_INITPHYACCESSPINS_ENET0_RST_B_GPIO, BOARD_INITPHYACCESSPINS_ENET0_RST_B_GPIO_PIN, 1);
    SDK_DelayAtLeastUs(150000, CLOCK_GetFreq(kCLOCK_CpuClk));
}
#endif

void rt_hw_board_init()
{
    BOARD_CommonSetting();
    BOARD_ConfigMPU();
    BOARD_InitBootPins();
    BOARD_BootClockRUN();

    NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_4);
    SysTick_Config(SystemCoreClock / RT_TICK_PER_SECOND);

#ifdef RT_USING_HEAP
    rt_system_heap_init((void *)HEAP_BEGIN, (void *)HEAP_END);
#endif

#ifdef RT_USING_COMPONENTS_INIT
    rt_components_board_init();
#endif

#ifdef RT_USING_CONSOLE
    rt_console_set_device(RT_CONSOLE_DEVICE_NAME);
#endif

#ifdef RT_USING_HEAP
    rt_kprintf("SystemCoreClock: %d Hz\n", SystemCoreClock);
    rt_kprintf("Heap: 0x%08x - 0x%08x (Size: %d bytes)\n",
               HEAP_BEGIN, HEAP_END,
               (uint32_t)HEAP_END - (uint32_t)HEAP_BEGIN);
#endif
}

